Revit 2027 API
ParameterTypeId.EnergyAnalysisCurrentViewOnly Property
 "Use Only Elements Visible In Current View"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisCurrentViewOnly { get; }
Public Shared ReadOnly Property EnergyAnalysisCurrentViewOnly As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisCurrentViewOnly {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisCurrentViewOnly : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace